wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
/**************************************************************************//**
 * @file     clk_reg.h
 * @version  V1.00
 * @brief    CLK register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (c) 2017-2026 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __CLK_REG_H__
#define __CLK_REG_H__

/** @addtogroup REGISTER Control Register
  @{
*/

/*---------------------- System Clock Controller -------------------------*/
/**
    @addtogroup CLK Clock Controller (CLK)
    Memory Mapped Structure for CLK Controller
  @{
*/

typedef struct
{
    /**
     * @var CLK_T::SRCCTL
     * Offset: 0x00  Clock Source Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LIRCEN    |LIRC Enable Bit (Write Protect)
     * |        |          |0 = 32 kHz internal low speed RC oscillator (LIRC) Disabled.
     * |        |          |1 = 32 kHz internal low speed RC oscillator (LIRC) Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[1]     |LXTEN     |LXT Enable Bit (Write Protect) (Write Only)
     * |        |          |0 = 32.768 kHz external low speed crystal (LXT) Disabled.
     * |        |          |1 = 32.768 kHz external low speed crystal (LXT) Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is clear if LXTFIF(CLK_CLKDSTS[13]) is 1.
     * |[2]     |HXTEN     |HXT Enable Bit (Write Protect)
     * |        |          |0 = 4~32 MHz external high speed crystal (HXT) Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal (HXT) Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: This bit is write ignore when HCLKSEL(CLK_HCLKSEL[2:0]) is set to HXT.
     * |        |          |Note 3: This bit is clear if HXTFIF(CLK_CLKDSTS[5]) is 1.
     * |[3]     |HIRCEN    |HIRC Enable Bit (Write Protect)
     * |        |          |0 = 40 MHz internal high speed RC oscillator (HIRC) Disabled.
     * |        |          |1 = 40 MHz internal high speed RC oscillator (HIRC) Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: This bit is write ignore when HCLKSEL(CLK_HCLKSEL[2:0]) is set to HIRC.
     * |[4]     |PLLEN     |PLL1 Enable Bit (Write Protect)
     * |        |          |0 = PLL Disabled.
     * |        |          |1 = PLL Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::STATUS
     * Offset: 0x04  Clock Status Monitor Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LIRCSTB   |LIRC Clock Source Stable Flag (Read Only)
     * |        |          |0 = 32 kHz internal low speed RC oscillator (LIRC) clock is not stable or disabled.
     * |        |          |1 = 32 kHz internal low speed RC oscillator (LIRC) clock is stable and enabled.
     * |[1]     |LXTSTB    |LXT Clock Source Stable Flag (Read Only)
     * |        |          |0 = 32.768 kHz external low speed crystal oscillator (LXT) clock is not stable or disabled.
     * |        |          |1 = 32.768 kHz external low speed crystal oscillator (LXT) clock is stabled and enabled.
     * |[2]     |HXTSTB    |HXT Clock Source Stable Flag (Read Only)
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock is not stable or disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock is stable and enabled.
     * |[3]     |HIRCSTB   |HIRC Clock Source Stable Flag (Read Only)
     * |        |          |0 = 40 MHz internal high speed RC oscillator (HIRC) clock is not stable or disabled.
     * |        |          |1 = 40 MHz internal high speed RC oscillator (HIRC) clock is stable and enabled.
     * |[4]     |PLLSTB    |Internal PLL Clock Source Stable Flag (Read Only)
     * |        |          |0 = Internal PLL clock is not stable or disabled.
     * |        |          |1 = Internal PLL clock is stable and enabled.
     * |[8]     |HCLKSWF   |HCLK Switching Finish Flag (Read Only)
     * |        |          |This bit is updated when software switches system clock source
     * |        |          |If switch target clock is stable, this bit will be set to 1
     * |        |          |If switch target clock is not stable, this bit will be set to 0.
     * |        |          |0 = Clock switching not finish.
     * |        |          |1 = Clock switching finish.
     * |        |          |Note 1: This bit is read only
     * |        |          |After selected clock source is stable, hardware will switch system clock to selected clock automatically, and HCLKSWF will be setted automatically by hardware.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * @var CLK_T::LXTCTL
     * Offset: 0x08  LXT Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |LXTGAIN   |LXT Gain Control Bit (Write Protect)
     * |        |          |Gain control is used to enlarge the gain of crystal to make sure crystal work normally.
     * |        |          |00 = gm is 3.9uA/V.
     * |        |          |01 = gm is 9.6uA/V.
     * |        |          |10 = gm is 14.2uA/V..
     * |        |          |11 = gm is 20.8uA/V.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::HIRCCTL
     * Offset: 0x0C  HIRC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |HIRCSTBS  |HIRC Stable Count Select (Write Protect)
     * |        |          |00 = HIRC stable count is 61 clocks and clock output deviation about 2%.
     * |        |          |01 = HIRC stable count is 51 clocks and clock output deviation about 3%.
     * |        |          |10 = HIRC stable count is 46 clocks and clock output deviation about 4%.
     * |        |          |11 = HIRC stable count is 42 clocks and clock output deviation about 5%.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[4]     |HIRCFDIS  |HIRC Clock Filter Disable Bit (Write Protect)
     * |        |          |0 = HIRC Filter enabled.
     * |        |          |1 = HIRC Filter disabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::HXTCTL
     * Offset: 0x10  HXT Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |HXTGAIN   |HXT Gain Control Bit (Write Protect)
     * |        |          |The default value is set by Flash controller user configuration register XT1XSG (CONFIG0 [18:16]).
     * |        |          |Gain control is used to enlarge the gain of crystal to make sure crystal work normally.
     * |        |          |000 = HXT frequency is from 4 MHz.
     * |        |          |001 = HXT frequency is from 4 MHz to 8 MHz.
     * |        |          |010 = HXT frequency is from 8 MHz to 12 MHz.
     * |        |          |011 = HXT frequency is from 12 MHz to 16 MHz.
     * |        |          |100 = HXT frequency is from 16 MHz to 24 MHz.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: The default value is set by UCFG0[18:16].
     * |[4]     |HXTSELTYP |HXT Crystal Type Select Bit (Write Protect)
     * |        |          |0 = Select INV type.
     * |        |          |1 = Select GM type.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[5]     |HXTMD     |HXT Mode Selection (Write Protect)
     * |        |          |0 = HXT work as crystal mode. PF.2 and PF.3 are configured as external high speed crystal (HXT) pins.
     * |        |          |1 = HXT works as external clock mode. PF.3 is configured as external clock input pin.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGCTL register.
     * |        |          |Note 2: When external clock mode enable, HXTSELTYP(CLK_HXTCTL[4]) must be set as GM type.
     * |[6]     |HXTFDIS   |HXT Clock Filter Disable Bit (Write Protect)
     * |        |          |0 = HXT Filter enabled.
     * |        |          |1 = HXT Filter disabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[7]     |HXTFSEL   |HXT Filter Select (Write Protect)
     * |        |          |0 = HXT frequency is <= 24 MHz.
     * |        |          |1 = HXT frequency is <= 4 MHz.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::PLLCTL
     * Offset: 0x18  PLL Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |FBDIV     |PLL Feedback Divider Control (Write Protect)
     * |        |          |Refer to the formulas below the table.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are write ignore when PLLEN(CLK_SRCCTL[4]) is set to enable.
     * |[11:8]  |INDIV     |PLL Input Divider Control (Write Protect)
     * |        |          |Refer to the formulas below the table.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are write ignore when PLLEN(CLK_SRCCTL[4]) is set to enable.
     * |[29:28] |STBSEL    |PLL Stable Counter Selection (Write Protect)
     * |        |          |00 = PLL stable time is 400 PLL source clock (source clock is equal to 4M).
     * |        |          |01 = PLL stable time is 1200 PLL source clock (4 MHz < source clock <=12 MHz).
     * |        |          |10 = PLL stable time is 2400 PLL source clock (12 MHz < source clock <=24 MHz).
     * |        |          |11 = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are write ignore when PLLEN(CLK_SRCCTL[4]) is set to enable.
     * |[30]    |BP        |PLL Bypass Control (Write Protect)
     * |        |          |0 = PLL is in normal mode (default).
     * |        |          |1 = PLL clock output is same as PLL input clock FIN.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: This bit is write ignore when PLLEN(CLK_SRCCTL[4]) is set to enable.
     * @var CLK_T::CLKOCTL
     * Offset: 0x28  Clock Output Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |FREQSEL   |Clock Output Frequency Selection
     * |        |          |The formula of output frequency is
     * |        |          |Fout = Fin/2(N+1).
     * |        |          |Fin is the input clock frequency.
     * |        |          |Fout is the frequency of divider output clock.
     * |        |          |N is the 4-bit value of FREQSEL[3:0].
     * |[4]     |CLKOEN    |Clock Output Enable Bit
     * |        |          |0 = Clock Output function Disabled.
     * |        |          |1 = Clock Output function Enabled.
     * |[5]     |DIV1EN    |Clock Output Divide One Enable Bit
     * |        |          |0 = Clock Output will output clock with source frequency divided by FREQSEL.
     * |        |          |1 = Clock Output will output clock with source frequency.
     * |[6]     |CLK1HZEN  |Clock Output 1Hz Enable Bit
     * |        |          |0 = 1 Hz clock output for 32.768 kHz frequency compensation Disabled.
     * |        |          |1 = 1 Hz clock output for 32.768 kHz frequency compensation Enabled.
     * @var CLK_T::CLKDCTL
     * Offset: 0x30  Clock Fail Detector Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4]     |HXTFDEN   |HXT Clock Fail Detector Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector Enabled.
     * |[5]     |HXTFIEN   |HXT Clock Fail Interrupt Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail interrupt Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail interrupt Enabled.
     * |[6]     |HXTFDSEL  |HXT Clock Fail Detector Selection
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector after HXT stable.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector bypass HXT stable.
     * |        |          |Note 1: When HXT Clock Fail Detector Selection is set, detector will keep detect whether HXT is stable or not, prevent HXT fail before stable.
     * |[12]    |LXTFDEN   |LXT Clock Fail Detector Enable Bit
     * |        |          |0 = 32.768 kHz external low speed crystal oscillator (LXT) clock fail detector Disabled.
     * |        |          |1 = 32.768 kHz external low speed crystal oscillator (LXT) clock fail detector Enabled.
     * |[13]    |LXTFIEN   |LXT Clock Fail Interrupt Enable Bit
     * |        |          |0 = 32.768 kHz external low speed crystal oscillator (LXT) clock fail interrupt Disabled.
     * |        |          |1 = 32.768 kHz external low speed crystal oscillator (LXT) clock fail interrupt Enabled.
     * |[16]    |HXTFQDEN  |HXT Clock Frequency Range Detector Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency range detector Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency range detector Enabled.
     * |[17]    |HXTFQIEN  |HXT Clock Frequency Range Detector Interrupt Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency range detector fail interrupt Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency range detector fail interrupt Enabled.
     * |[18]    |HXTFQASW  |HXT Clock Frequency Range Detector Event Auto Switch Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency range detector fail event happened and HCLK will not switch to HIRC automatically.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency range detector fail event happened and HCLK will switch to HIRC automatically.
     * |        |          |Note 1: This bit should be set before HXTFQDEN(CLK_CLKDCTL[16]).
     * @var CLK_T::CLKDSTS
     * Offset: 0x34  Clock Fail Detector Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4]     |HXTFDST   |HXT Clock Fail Detector Status Bit (Read Only)
     * |        |          |0 = Indicate 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector already disabled.
     * |        |          |1 = Indicate 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector already enabled.
     * |[5]     |HXTFIF    |HXT Clock Fail Interrupt Flag (Write Protect)
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock is normal.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock stops.
     * |        |          |Note 1: Write 1 to clear this bit to 0.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[12]    |LXTFDST   |LXT Clock Fail Detector Status Bit (Read Only)
     * |        |          |0 = Indicate 32.768 kHz external low speed crystal oscillator (LXT) clock fail detector already disabled.
     * |        |          |1 = Indicate 32.768 kHz external low speed crystal oscillator (LXT) clock fail detector already enabled.
     * |[13]    |LXTFIF    |LXT Clock Fail Interrupt Flag (Write Protect)
     * |        |          |0 = 32.768 kHz external low speed crystal oscillator (LXT) clock is normal.
     * |        |          |1 = 32.768 kHz external low speed crystal oscillator (LXT) stops.
     * |        |          |Note 1: Write 1 to clear this bit to 0.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[17]    |HXTFQIF   |HXT Clock Frequency Range Detector Interrupt Flag (Write Protect)
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency is normal.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency is abnormal.
     * |        |          |Note 1: Write 1 to clear this bit to 0.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::CDUPB
     * Offset: 0x38  Clock Frequency Range Detector Upper Boundary Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[9:0]   |UPERBD    |HXT Clock Frequency Range Detector Upper Boundary Value
     * |        |          |The bits define the high value of frequency monitor window.
     * |        |          |When HXT frequency monitor value higher than this register, the HXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Frequency out of range will be asserted when HXT frequency > ((UPERBD+1)/512)* HIRC frequency.
     * @var CLK_T::CDLOWB
     * Offset: 0x3C  Clock Frequency Range Detector Lower Boundary Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[9:0]   |LOWERBD   |HXT Clock Frequency Range Detector Lower Boundary Value
     * |        |          |The bits define the low value of frequency monitor window.
     * |        |          |When HXT frequency monitor value lower than this register, the HXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Frequency out of range will be asserted when HXT frequency < ((LOWERBD+1)/512)* HIRC frequency.
     * @var CLK_T::ADCCTL
     * Offset: 0x80  ADC Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADC0CKEN  |ADCx Clock Enable Bit
     * |        |          |0 = ADCx clock Disabled.
     * |        |          |1 = ADCx clock Enabled.
     * @var CLK_T::BPWMCTL
     * Offset: 0x84  BPWM Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BPWM0CKEN |BPWMx Clock Enable Bit
     * |        |          |0 = BPWMx clock Disabled.
     * |        |          |1 = BPWMx clock Enabled.
     * |[1]     |BPWM1CKEN |BPWMx Clock Enable Bit
     * |        |          |0 = BPWMx clock Disabled.
     * |        |          |1 = BPWMx clock Enabled.
     * @var CLK_T::CRCCTL
     * Offset: 0x88  CRC Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CRC0CKEN  |CRCx Clock Enable Bit
     * |        |          |0 = CRCx clock Disabled.
     * |        |          |1 = CRCx clock Enabled.
     * @var CLK_T::FMCCTL
     * Offset: 0x8C  FMC Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FMC0CKEN  |FMCx Clock Enable Bit
     * |        |          |0 = FMCx clock Disabled when chip is under IDLE mode.
     * |        |          |1 = FMCx clock Enabled when chip is under IDLE mode.
     * |[8]     |DFMC0CKEN |Data FMCx Clock Enable Bit
     * |        |          |0 = DFMCx clock Disabled.
     * |        |          |1 = DFMCx clock Enabled.
     * |[16]    |ISP0CKEN  |ISPx Clock Enable Bit
     * |        |          |0 = ISPx clock Disabled.
     * |        |          |1 = ISPx clock Enabled.
     * @var CLK_T::GPIOCTL
     * Offset: 0x90  GPIO Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |GPIOACKEN |GPIOA Clock Enable Bit
     * |        |          |0 = GPIOA clock Disabled.
     * |        |          |1 = GPIOA clock Enabled.
     * |[1]     |GPIOBCKEN |GPIOB Clock Enable Bit
     * |        |          |0 = GPIOB clock Disabled.
     * |        |          |1 = GPIOB clock Enabled.
     * |[2]     |GPIOCCKEN |GPIOC Clock Enable Bit
     * |        |          |0 = GPIOC clock Disabled.
     * |        |          |1 = GPIOC clock Enabled.
     * |[3]     |GPIODCKEN |GPIOD Clock Enable Bit
     * |        |          |0 = GPIOD clock Disabled.
     * |        |          |1 = GPIOD clock Enabled.
     * |[4]     |GPIOECKEN |GPIOE Clock Enable Bit
     * |        |          |0 = GPIOE clock Disabled.
     * |        |          |1 = GPIOE clock Enabled.
     * |[5]     |GPIOFCKEN |GPIOF Clock Enable Bit
     * |        |          |0 = GPIOF clock Disabled.
     * |        |          |1 = GPIOF clock Enabled.
     * |[6]     |GPIOGCKEN |GPIOG Clock Enable Bit
     * |        |          |0 = GPIOG clock Disabled.
     * |        |          |1 = GPIOG clock Enabled.
     * @var CLK_T::I2CCTL
     * Offset: 0x94  I2C Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |I2C0CKEN  |I2Cx Clock Enable Bit
     * |        |          |0 = I2Cx clock Disabled.
