wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
     * |        |          |1 = I2Cx clock Enabled.
     * |[1]     |I2C1CKEN  |I2Cx Clock Enable Bit
     * |        |          |0 = I2Cx clock Disabled.
     * |        |          |1 = I2Cx clock Enabled.
     * |[2]     |I2C2CKEN  |I2Cx Clock Enable Bit
     * |        |          |0 = I2Cx clock Disabled.
     * |        |          |1 = I2Cx clock Enabled.
     * @var CLK_T::PDMACTL
     * Offset: 0x98  PDMA Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PDMA0CKEN |PDMAx Clock Enable Bit
     * |        |          |0 = PDMAx clock Disabled.
     * |        |          |1 = PDMAx clock Enabled.
     * @var CLK_T::RTCCTL
     * Offset: 0x9C  RTC Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |RTC0CKEN  |RTCx Clock Enable Bit
     * |        |          |0 = RTCx clock Disabled.
     * |        |          |1 = RTCx clock Enabled.
     * @var CLK_T::SRAMCTL
     * Offset: 0xA0  System SRAM Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SRAM0CKEN |SRAM0 Clock Enable Bit
     * |        |          |0 = SRAM0 clock Disabled.
     * |        |          |1 = SRAM0 clock Enabled.
     * |[1]     |SRAM1CKEN |SRAM1 Clock Enable Bit
     * |        |          |0 = SRAM1 clock Disabled.
     * |        |          |1 = SRAM1 clock Enabled.
     * @var CLK_T::STCTL
     * Offset: 0xA4  System Tick Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ST0CKEN   |SYSTICKx Clock Enable Bit
     * |        |          |0 = SYSTICKx clock Disabled.
     * |        |          |1 = SYSTICKx clock Enabled.
     * @var CLK_T::TMRCTL
     * Offset: 0xA8  Timer Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TMR0CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[1]     |TMR1CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[2]     |TMR2CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[3]     |TMR3CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[4]     |TMR4CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[5]     |TMR5CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[6]     |TMR6CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[7]     |TMR7CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * |[8]     |TMR8CKEN  |TIMERx Clock Enable Bit
     * |        |          |0 = TIMERx clock Disabled.
     * |        |          |1 = TIMERx clock Enabled.
     * @var CLK_T::UARTCTL
     * Offset: 0xAC  UART Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |UART0CKEN |UARTx Clock Enable Bit
     * |        |          |0 = UARTx clock Disabled.
     * |        |          |1 = UARTx clock Enabled.
     * |[1]     |UART1CKEN |UARTx Clock Enable Bit
     * |        |          |0 = UARTx clock Disabled.
     * |        |          |1 = UARTx clock Enabled.
     * |[2]     |UART2CKEN |UARTx Clock Enable Bit
     * |        |          |0 = UARTx clock Disabled.
     * |        |          |1 = UARTx clock Enabled.
     * |[3]     |UART3CKEN |UARTx Clock Enable Bit
     * |        |          |0 = UARTx clock Disabled.
     * |        |          |1 = UARTx clock Enabled.
     * |[4]     |UART4CKEN |UARTx Clock Enable Bit
     * |        |          |0 = UARTx clock Disabled.
     * |        |          |1 = UARTx clock Enabled.
     * @var CLK_T::USCICTL
     * Offset: 0xB0  USCI Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |USCI0CKEN |USCIx Clock Enable Bit
     * |        |          |0 = USCIx clock Disabled.
     * |        |          |1 = USCIx clock Enabled.
     * |[1]     |USCI1CKEN |USCIx Clock Enable Bit
     * |        |          |0 = USCIx clock Disabled.
     * |        |          |1 = USCIx clock Enabled.
     * |[2]     |USCI2CKEN |USCIx Clock Enable Bit
     * |        |          |0 = USCIx clock Disabled.
     * |        |          |1 = USCIx clock Enabled.
     * |[3]     |USCI3CKEN |USCIx Clock Enable Bit
     * |        |          |0 = USCIx clock Disabled.
     * |        |          |1 = USCIx clock Enabled.
     * |[4]     |USCI4CKEN |USCIx Clock Enable Bit
     * |        |          |0 = USCIx clock Disabled.
     * |        |          |1 = USCIx clock Enabled.
     * @var CLK_T::WDTCTL
     * Offset: 0xB4  WDT Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WDT0CKEN  |WDTx Clock Enable Bit
     * |        |          |0 = WDTx clock Disabled.
     * |        |          |1 = WDTx clock Enabled.
     * @var CLK_T::WWDTCTL
     * Offset: 0xB8  WWDT Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WWDT0CKEN |WWDTx Clock Enable Bit
     * |        |          |0 = WWDTx clock Disabled.
     * |        |          |1 = WWDTx clock Enabled.
     * @var CLK_T::HCLKSEL
     * Offset: 0x100  AHB Clock Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |HCLKSEL   |System Clock Source Selection (Write Protect)
     * |        |          |The system clock source is defined by SCLKSEL.
     * |        |          |000 = Clock source from HIRC.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from PLL.
     * |        |          |Others = Reserved.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::BPWMSEL
     * Offset: 0x104  BPWM Clock Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BPWM0SEL  |BPWM0 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of BPWM0 is defined by BPWM0SEL.
     * |        |          |0 = Clock source from PCLK0.
     * |        |          |1 = Clock source from HCLK.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[4]     |BPWM1SEL  |BPWM1 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of BPWM1 is defined by BPWM1SEL.
     * |        |          |0 = Clock source from PCLK1.
     * |        |          |1 = Clock source from HCLK.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::CLKOSEL
     * Offset: 0x108  Clock Output Clock Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |CLKOSEL   |Clock Output Clock Source Selection (Write Protect)
     * |        |          |000 = Clock source from HCLK.
     * |        |          |001 = Clock source from PCLK0.
     * |        |          |010 = Clock source from PCLK1.
     * |        |          |011 = Clock source from LIRC.
     * |        |          |100 = Clock source from LXT.
     * |        |          |101 = Clock source from HXT.
     * |        |          |110 = Clock source from HIRC.
     * |        |          |111 = Clock source from PLL.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::TMRSEL0
     * Offset: 0x10C  Timer Clock Source Select Control Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |TMR0SEL   |Timer 0 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR0 is defined by TMR0SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM0 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[6:4]   |TMR1SEL   |Timer 1 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR1 is defined by TMR1SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM1 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[10:8]  |TMR2SEL   |Timer 2 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR2 is defined by TMR2SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM2 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[14:12] |TMR3SEL   |Timer 3 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR3 is defined by TMR3SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM3 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[18:16] |TMR4SEL   |Timer 4 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR4 is defined by TMR4SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM4 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[22:20] |TMR5SEL   |Timer 5 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR5 is defined by TMR5SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM5 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[26:24] |TMR6SEL   |Timer 6 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR6 is defined by TMR6SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM6 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[30:28] |TMR7SEL   |Timer 7 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR7 is defined by TMR7SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM7 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::TMRSEL1
     * Offset: 0x110  Timer Clock Source Select Control Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |TMR8SEL   |Timer 8 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of TMR8 is defined by TMR8SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |101 = Clock source from external clock TM8 pin.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::UARTSEL
     * Offset: 0x114  UART Clock Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |UART0SEL  |UART 0 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of UART0 is defined by UART0SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D1 power is turned off.
     * |[6:4]   |UART1SEL  |UART 1 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of UART1 is defined by UART1SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D1 power is turned off.
     * |[10:8]  |UART2SEL  |UART 2 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of UART2 is defined by UART2SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D1 power is turned off.
     * |[14:12] |UART3SEL  |UART 3 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of UART3 is defined by UART3SEL.
     * |        |          |000 = Clock source from PCLK1.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D1 power is turned off.
     * |[18:16] |UART4SEL  |UART 4 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of UART4 is defined by UART4SEL.
     * |        |          |000 = Clock source from PCLK0.
     * |        |          |001 = Clock source from LIRC.
     * |        |          |010 = Clock source from LXT.
     * |        |          |011 = Clock source from HXT.
     * |        |          |100 = Clock source from HIRC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D1 power is turned off.
     * @var CLK_T::WDTSEL
     * Offset: 0x118  WDT Clock Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |WDT0SEL   |WDT0 Clock Source Selection (Write Protect)
     * |        |          |The peripheral clock source of WDT0 is defined by WDT0SEL.
     * |        |          |00 = Clock source from HCLK/2048.
     * |        |          |01 = Clock source from LXT.
     * |        |          |10 = Clock source from LIRC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::WWDTSEL
     * Offset: 0x11C  WWDT Clock Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WWDT0SEL  |WWDT0 Clock Source Selection (Write Protect)
     * |        |          |0 = Clock source from HCLK/2048.
     * |        |          |1 = Clock source from LIRC.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::HCLKDIV
     * Offset: 0x180  HCLK Clock Divider Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |HCLKDIV   |HCLK Clock Divide Number from HCLK0 Clock Source
     * |        |          |HCLK clock frequency = (HCLK clock source frequency) / (HCLKDIV + 1).
     * @var CLK_T::PCLKDIV
     * Offset: 0x184  PCLK Clock Divider Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PCLK0DIV  |PCLK0 Clock Divide Number from PCLK0 Clock Source
     * |        |          |000 = PCLK0 is divided by 1.
     * |        |          |001 = PCLK0 is divided by 2.
     * |        |          |010 = PCLK0 is divided by 4.
     * |        |          |011 = PCLK0 is divided by 8.
     * |        |          |100 = PCLK0 is divided by 16.
     * |        |          |Others = Reserved.
     * |[6:4]   |PCLK1DIV  |PCLK1 Clock Divide Number from PCLK1 Clock Source
     * |        |          |000 = PCLK1 is divided by 1.
     * |        |          |001 = PCLK1 is divided by 2.
     * |        |          |010 = PCLK1 is divided by 4.
     * |        |          |011 = PCLK1 is divided by 8.
     * |        |          |100 = PCLK1 is divided by 16.
     * |        |          |Others = Reserved.
     * @var CLK_T::ADCDIV
     * Offset: 0x190  ADC Clock Divider Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |ADC0DIV   |ADC0 Clock Divide Number from ADC0 Clock Source
     * |        |          |ADC0 clock frequency = (ADC0 clock source frequency) / (ADC0DIV + 1).
     * @var CLK_T::UARTDIV
     * Offset: 0x194  UART Clock Divider Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |UART0DIV  |UART0 Clock Divide Number from UART0 Clock Source
     * |        |          |UART0 clock frequency = (UART0 clock source frequency) / (UART0DIV + 1).
     * |[7:4]   |UART1DIV  |UART1 Clock Divide Number from UART1 Clock Source
