wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
     * |        |          |UART1 clock frequency = (UART1 clock source frequency) / (UART1DIV + 1).
     * |[11:8]  |UART2DIV  |UART2 Clock Divide Number from UART2 Clock Source
     * |        |          |UART2 clock frequency = (UART2 clock source frequency) / (UART2DIV + 1).
     * |[15:12] |UART3DIV  |UART3 Clock Divide Number from UART3 Clock Source
     * |        |          |UART3 clock frequency = (UART3 clock source frequency) / (UART3DIV + 1).
     * |[19:16] |UART4DIV  |UART4 Clock Divide Number from UART4 Clock Source
     * |        |          |UART4 clock frequency = (UART4 clock source frequency) / (UART4DIV + 1).
     */
    __IO uint32_t SRCCTL;                 /*!< [0x0000] Clock Source Control Register                                    */
    __I  uint32_t STATUS;                 /*!< [0x0004] Clock Status Monitor Register                                    */
    __IO uint32_t LXTCTL;                 /*!< [0x0008] LXT Control Register                                             */
    __IO uint32_t HIRCCTL;                /*!< [0x000c] HIRC Control Register                                            */
    __IO uint32_t HXTCTL;                 /*!< [0x0010] HXT Control Register                                             */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t PLLCTL;                 /*!< [0x0018] PLL Control Register                                             */
    __I  uint32_t RESERVE1[3];
    __IO uint32_t CLKOCTL;                /*!< [0x0028] Clock Output Control Register                                    */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t CLKDCTL;                /*!< [0x0030] Clock Fail Detector Control Register                             */
    __IO uint32_t CLKDSTS;                /*!< [0x0034] Clock Fail Detector Status Register                              */
    __IO uint32_t CDUPB;                  /*!< [0x0038] Clock Frequency Range Detector Upper Boundary Register           */
    __IO uint32_t CDLOWB;                 /*!< [0x003c] Clock Frequency Range Detector Lower Boundary Register           */
    __I  uint32_t RESERVE3[16];
    __IO uint32_t ADCCTL;                 /*!< [0x0080] ADC Clock Enable Control Register                                */
    __IO uint32_t BPWMCTL;                /*!< [0x0084] BPWM Clock Enable Control Register                               */
    __IO uint32_t CRCCTL;                 /*!< [0x0088] CRC Clock Enable Control Register                                */
    __IO uint32_t FMCCTL;                 /*!< [0x008c] FMC Clock Enable Control Register                                */
    __IO uint32_t GPIOCTL;                /*!< [0x0090] GPIO Clock Enable Control Register                               */
    __IO uint32_t I2CCTL;                 /*!< [0x0094] I2C Clock Enable Control Register                                */
    __IO uint32_t PDMACTL;                /*!< [0x0098] PDMA Clock Enable Control Register                               */
    __IO uint32_t RTCCTL;                 /*!< [0x009c] RTC Clock Enable Control Register                                */
    __IO uint32_t SRAMCTL;                /*!< [0x00a0] System SRAM Clock Enable Control Register                        */
    __IO uint32_t STCTL;                  /*!< [0x00a4] System Tick Clock Enable Control Register                        */
    __IO uint32_t TMRCTL;                 /*!< [0x00a8] Timer Clock Enable Control Register                              */
    __IO uint32_t UARTCTL;                /*!< [0x00ac] UART Clock Enable Control Register                               */
    __IO uint32_t USCICTL;                /*!< [0x00b0] USCI Clock Enable Control Register                               */
    __IO uint32_t WDTCTL;                 /*!< [0x00b4] WDT Clock Enable Control Register                                */
    __IO uint32_t WWDTCTL;                /*!< [0x00b8] WWDT Clock Enable Control Register                               */
    __I  uint32_t RESERVE4[17];
    __IO uint32_t HCLKSEL;                /*!< [0x0100] AHB Clock Source Select Control Register                         */
    __IO uint32_t BPWMSEL;                /*!< [0x0104] BPWM Clock Source Select Control Register                        */
    __IO uint32_t CLKOSEL;                /*!< [0x0108] Clock Output Clock Source Select Control Register                */
    __IO uint32_t TMRSEL0;                /*!< [0x010c] Timer Clock Source Select Control Register 0                     */
    __IO uint32_t TMRSEL1;                /*!< [0x0110] Timer Clock Source Select Control Register 1                     */
    __IO uint32_t UARTSEL;                /*!< [0x0114] UART Clock Source Select Control Register                        */
    __IO uint32_t WDTSEL;                 /*!< [0x0118] WDT Clock Source Select Control Register                         */
    __IO uint32_t WWDTSEL;                /*!< [0x011c] WWDT Clock Source Select Control Register                        */
    __I  uint32_t RESERVE5[24];
    __IO uint32_t HCLKDIV;                /*!< [0x0180] HCLK Clock Divider Control Register                              */
    __IO uint32_t PCLKDIV;                /*!< [0x0184] PCLK Clock Divider Control Register                              */
    __I  uint32_t RESERVE6[2];
    __IO uint32_t ADCDIV;                 /*!< [0x0190] ADC Clock Divider Control Register                               */
    __IO uint32_t UARTDIV;                /*!< [0x0194] UART Clock Divider Control Register                              */
} CLK_T;

/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
  @{
*/

#define CLK_SRCCTL_LIRCEN_Pos            (0)                                               /*!< CLK_T::SRCCTL: LIRCEN Position         */
#define CLK_SRCCTL_LIRCEN_Msk            (0x1ul << CLK_SRCCTL_LIRCEN_Pos)                  /*!< CLK_T::SRCCTL: LIRCEN Mask             */

#define CLK_SRCCTL_LXTEN_Pos             (1)                                               /*!< CLK_T::SRCCTL: LXTEN Position          */
#define CLK_SRCCTL_LXTEN_Msk             (0x1ul << CLK_SRCCTL_LXTEN_Pos)                   /*!< CLK_T::SRCCTL: LXTEN Mask              */

#define CLK_SRCCTL_HXTEN_Pos             (2)                                               /*!< CLK_T::SRCCTL: HXTEN Position          */
#define CLK_SRCCTL_HXTEN_Msk             (0x1ul << CLK_SRCCTL_HXTEN_Pos)                   /*!< CLK_T::SRCCTL: HXTEN Mask              */

