wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
#define CLK_SRCCTL_HIRCEN_Pos            (3)                                               /*!< CLK_T::SRCCTL: HIRCEN Position         */
#define CLK_SRCCTL_HIRCEN_Msk            (0x1ul << CLK_SRCCTL_HIRCEN_Pos)                  /*!< CLK_T::SRCCTL: HIRCEN Mask             */

#define CLK_SRCCTL_PLLEN_Pos             (4)                                               /*!< CLK_T::SRCCTL: PLLEN Position          */
#define CLK_SRCCTL_PLLEN_Msk             (0x1ul << CLK_SRCCTL_PLLEN_Pos)                   /*!< CLK_T::SRCCTL: PLLEN Mask              */

#define CLK_STATUS_LIRCSTB_Pos           (0)                                               /*!< CLK_T::STATUS: LIRCSTB Position        */
#define CLK_STATUS_LIRCSTB_Msk           (0x1ul << CLK_STATUS_LIRCSTB_Pos)                 /*!< CLK_T::STATUS: LIRCSTB Mask            */

#define CLK_STATUS_LXTSTB_Pos            (1)                                               /*!< CLK_T::STATUS: LXTSTB Position         */
#define CLK_STATUS_LXTSTB_Msk            (0x1ul << CLK_STATUS_LXTSTB_Pos)                  /*!< CLK_T::STATUS: LXTSTB Mask             */

#define CLK_STATUS_HXTSTB_Pos            (2)                                               /*!< CLK_T::STATUS: HXTSTB Position         */
#define CLK_STATUS_HXTSTB_Msk            (0x1ul << CLK_STATUS_HXTSTB_Pos)                  /*!< CLK_T::STATUS: HXTSTB Mask             */

#define CLK_STATUS_HIRCSTB_Pos           (3)                                               /*!< CLK_T::STATUS: HIRCSTB Position        */
#define CLK_STATUS_HIRCSTB_Msk           (0x1ul << CLK_STATUS_HIRCSTB_Pos)                 /*!< CLK_T::STATUS: HIRCSTB Mask            */

#define CLK_STATUS_PLLSTB_Pos            (4)                                               /*!< CLK_T::STATUS: PLLSTB Position         */
#define CLK_STATUS_PLLSTB_Msk            (0x1ul << CLK_STATUS_PLLSTB_Pos)                  /*!< CLK_T::STATUS: PLLSTB Mask             */

#define CLK_STATUS_HCLKSWF_Pos           (8)                                               /*!< CLK_T::STATUS: HCLKSWF Position        */
#define CLK_STATUS_HCLKSWF_Msk           (0x1ul << CLK_STATUS_HCLKSWF_Pos)                 /*!< CLK_T::STATUS: HCLKSWF Mask            */

#define CLK_LXTCTL_LXTGAIN_Pos           (0)                                               /*!< CLK_T::LXTCTL: LXTGAIN Position        */
#define CLK_LXTCTL_LXTGAIN_Msk           (0x3ul << CLK_LXTCTL_LXTGAIN_Pos)                 /*!< CLK_T::LXTCTL: LXTGAIN Mask            */

#define CLK_HIRCCTL_HIRCSTBS_Pos         (0)                                               /*!< CLK_T::HIRCCTL: HIRCSTBS Position      */
#define CLK_HIRCCTL_HIRCSTBS_Msk         (0x3ul << CLK_HIRCCTL_HIRCSTBS_Pos)               /*!< CLK_T::HIRCCTL: HIRCSTBS Mask          */

#define CLK_HIRCCTL_HIRCFDIS_Pos         (4)                                               /*!< CLK_T::HIRCCTL: HIRCFDIS Position      */
#define CLK_HIRCCTL_HIRCFDIS_Msk         (0x1ul << CLK_HIRCCTL_HIRCFDIS_Pos)               /*!< CLK_T::HIRCCTL: HIRCFDIS Mask          */

#define CLK_HXTCTL_HXTGAIN_Pos           (0)                                               /*!< CLK_T::HXTCTL: HXTGAIN Position        */
#define CLK_HXTCTL_HXTGAIN_Msk           (0x7ul << CLK_HXTCTL_HXTGAIN_Pos)                 /*!< CLK_T::HXTCTL: HXTGAIN Mask            */

#define CLK_HXTCTL_HXTSELTYP_Pos         (4)                                               /*!< CLK_T::HXTCTL: HXTSELTYP Position      */
#define CLK_HXTCTL_HXTSELTYP_Msk         (0x1ul << CLK_HXTCTL_HXTSELTYP_Pos)               /*!< CLK_T::HXTCTL: HXTSELTYP Mask          */

#define CLK_HXTCTL_HXTMD_Pos             (5)                                               /*!< CLK_T::HXTCTL: HXTMD Position          */
#define CLK_HXTCTL_HXTMD_Msk             (0x1ul << CLK_HXTCTL_HXTMD_Pos)                   /*!< CLK_T::HXTCTL: HXTMD Mask              */

#define CLK_HXTCTL_HXTFDIS_Pos           (6)                                               /*!< CLK_T::HXTCTL: HXTFDIS Position        */
#define CLK_HXTCTL_HXTFDIS_Msk           (0x1ul << CLK_HXTCTL_HXTFDIS_Pos)                 /*!< CLK_T::HXTCTL: HXTFDIS Mask            */

#define CLK_HXTCTL_HXTFSEL_Pos           (7)                                               /*!< CLK_T::HXTCTL: HXTFSEL Position        */
#define CLK_HXTCTL_HXTFSEL_Msk           (0x1ul << CLK_HXTCTL_HXTFSEL_Pos)                 /*!< CLK_T::HXTCTL: HXTFSEL Mask            */

#define CLK_PLLCTL_FBDIV_Pos             (0)                                               /*!< CLK_T::PLLCTL: FBDIV Position          */
#define CLK_PLLCTL_FBDIV_Msk             (0xful << CLK_PLLCTL_FBDIV_Pos)                   /*!< CLK_T::PLLCTL: FBDIV Mask              */

#define CLK_PLLCTL_INDIV_Pos             (8)                                               /*!< CLK_T::PLLCTL: INDIV Position          */
#define CLK_PLLCTL_INDIV_Msk             (0xful << CLK_PLLCTL_INDIV_Pos)                   /*!< CLK_T::PLLCTL: INDIV Mask              */

#define CLK_PLLCTL_STBSEL_Pos            (28)                                              /*!< CLK_T::PLLCTL: STBSEL Position         */
#define CLK_PLLCTL_STBSEL_Msk            (0x3ul << CLK_PLLCTL_STBSEL_Pos)                  /*!< CLK_T::PLLCTL: STBSEL Mask             */

#define CLK_PLLCTL_BP_Pos                (30)                                              /*!< CLK_T::PLLCTL: BP Position             */
#define CLK_PLLCTL_BP_Msk                (0x1ul << CLK_PLLCTL_BP_Pos)                      /*!< CLK_T::PLLCTL: BP Mask                 */

#define CLK_CLKOCTL_FREQSEL_Pos          (0)                                               /*!< CLK_T::CLKOCTL: FREQSEL Position       */
#define CLK_CLKOCTL_FREQSEL_Msk          (0xful << CLK_CLKOCTL_FREQSEL_Pos)                /*!< CLK_T::CLKOCTL: FREQSEL Mask           */

#define CLK_CLKOCTL_CLKOEN_Pos           (4)                                               /*!< CLK_T::CLKOCTL: CLKOEN Position        */
#define CLK_CLKOCTL_CLKOEN_Msk           (0x1ul << CLK_CLKOCTL_CLKOEN_Pos)                 /*!< CLK_T::CLKOCTL: CLKOEN Mask            */

#define CLK_CLKOCTL_DIV1EN_Pos           (5)                                               /*!< CLK_T::CLKOCTL: DIV1EN Position        */
#define CLK_CLKOCTL_DIV1EN_Msk           (0x1ul << CLK_CLKOCTL_DIV1EN_Pos)                 /*!< CLK_T::CLKOCTL: DIV1EN Mask            */

#define CLK_CLKOCTL_CLK1HZEN_Pos         (6)                                               /*!< CLK_T::CLKOCTL: CLK1HZEN Position      */
#define CLK_CLKOCTL_CLK1HZEN_Msk         (0x1ul << CLK_CLKOCTL_CLK1HZEN_Pos)               /*!< CLK_T::CLKOCTL: CLK1HZEN Mask          */

#define CLK_CLKDCTL_HXTFDEN_Pos          (4)                                               /*!< CLK_T::CLKDCTL: HXTFDEN Position       */
#define CLK_CLKDCTL_HXTFDEN_Msk          (0x1ul << CLK_CLKDCTL_HXTFDEN_Pos)                /*!< CLK_T::CLKDCTL: HXTFDEN Mask           */

