wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
#define CLK_CLKDCTL_HXTFIEN_Pos          (5)                                               /*!< CLK_T::CLKDCTL: HXTFIEN Position       */
#define CLK_CLKDCTL_HXTFIEN_Msk          (0x1ul << CLK_CLKDCTL_HXTFIEN_Pos)                /*!< CLK_T::CLKDCTL: HXTFIEN Mask           */

#define CLK_CLKDCTL_HXTFDSEL_Pos         (6)                                               /*!< CLK_T::CLKDCTL: HXTFDSEL Position      */
#define CLK_CLKDCTL_HXTFDSEL_Msk         (0x1ul << CLK_CLKDCTL_HXTFDSEL_Pos)               /*!< CLK_T::CLKDCTL: HXTFDSEL Mask          */

#define CLK_CLKDCTL_LXTFDEN_Pos          (12)                                              /*!< CLK_T::CLKDCTL: LXTFDEN Position       */
#define CLK_CLKDCTL_LXTFDEN_Msk          (0x1ul << CLK_CLKDCTL_LXTFDEN_Pos)                /*!< CLK_T::CLKDCTL: LXTFDEN Mask           */

#define CLK_CLKDCTL_LXTFIEN_Pos          (13)                                              /*!< CLK_T::CLKDCTL: LXTFIEN Position       */
#define CLK_CLKDCTL_LXTFIEN_Msk          (0x1ul << CLK_CLKDCTL_LXTFIEN_Pos)                /*!< CLK_T::CLKDCTL: LXTFIEN Mask           */

#define CLK_CLKDCTL_HXTFQDEN_Pos         (16)                                              /*!< CLK_T::CLKDCTL: HXTFQDEN Position      */
#define CLK_CLKDCTL_HXTFQDEN_Msk         (0x1ul << CLK_CLKDCTL_HXTFQDEN_Pos)               /*!< CLK_T::CLKDCTL: HXTFQDEN Mask          */

#define CLK_CLKDCTL_HXTFQIEN_Pos         (17)                                              /*!< CLK_T::CLKDCTL: HXTFQIEN Position      */
#define CLK_CLKDCTL_HXTFQIEN_Msk         (0x1ul << CLK_CLKDCTL_HXTFQIEN_Pos)               /*!< CLK_T::CLKDCTL: HXTFQIEN Mask          */

#define CLK_CLKDCTL_HXTFQASW_Pos         (18)                                              /*!< CLK_T::CLKDCTL: HXTFQASW Position      */
#define CLK_CLKDCTL_HXTFQASW_Msk         (0x1ul << CLK_CLKDCTL_HXTFQASW_Pos)               /*!< CLK_T::CLKDCTL: HXTFQASW Mask          */

#define CLK_CLKDSTS_HXTFDST_Pos          (4)                                               /*!< CLK_T::CLKDSTS: HXTFDST Position       */
#define CLK_CLKDSTS_HXTFDST_Msk          (0x1ul << CLK_CLKDSTS_HXTFDST_Pos)                /*!< CLK_T::CLKDSTS: HXTFDST Mask           */

#define CLK_CLKDSTS_HXTFIF_Pos           (5)                                               /*!< CLK_T::CLKDSTS: HXTFIF Position        */
#define CLK_CLKDSTS_HXTFIF_Msk           (0x1ul << CLK_CLKDSTS_HXTFIF_Pos)                 /*!< CLK_T::CLKDSTS: HXTFIF Mask            */

#define CLK_CLKDSTS_LXTFDST_Pos          (12)                                              /*!< CLK_T::CLKDSTS: LXTFDST Position       */
#define CLK_CLKDSTS_LXTFDST_Msk          (0x1ul << CLK_CLKDSTS_LXTFDST_Pos)                /*!< CLK_T::CLKDSTS: LXTFDST Mask           */

#define CLK_CLKDSTS_LXTFIF_Pos           (13)                                              /*!< CLK_T::CLKDSTS: LXTFIF Position        */
#define CLK_CLKDSTS_LXTFIF_Msk           (0x1ul << CLK_CLKDSTS_LXTFIF_Pos)                 /*!< CLK_T::CLKDSTS: LXTFIF Mask            */

#define CLK_CLKDSTS_HXTFQIF_Pos          (17)                                              /*!< CLK_T::CLKDSTS: HXTFQIF Position       */
#define CLK_CLKDSTS_HXTFQIF_Msk          (0x1ul << CLK_CLKDSTS_HXTFQIF_Pos)                /*!< CLK_T::CLKDSTS: HXTFQIF Mask           */

#define CLK_CDUPB_UPERBD_Pos             (0)                                               /*!< CLK_T::CDUPB: UPERBD Position          */
#define CLK_CDUPB_UPERBD_Msk             (0x3fful << CLK_CDUPB_UPERBD_Pos)                 /*!< CLK_T::CDUPB: UPERBD Mask              */

#define CLK_CDLOWB_LOWERBD_Pos           (0)                                               /*!< CLK_T::CDLOWB: LOWERBD Position        */
#define CLK_CDLOWB_LOWERBD_Msk           (0x3fful << CLK_CDLOWB_LOWERBD_Pos)               /*!< CLK_T::CDLOWB: LOWERBD Mask            */

#define CLK_ADCCTL_ADC0CKEN_Pos          (0)                                               /*!< CLK_T::ADCCTL: ADC0CKEN Position       */
#define CLK_ADCCTL_ADC0CKEN_Msk          (0x1ul << CLK_ADCCTL_ADC0CKEN_Pos)                /*!< CLK_T::ADCCTL: ADC0CKEN Mask           */

#define CLK_BPWMCTL_BPWM0CKEN_Pos        (0)                                               /*!< CLK_T::BPWMCTL: BPWM0CKEN Position     */
#define CLK_BPWMCTL_BPWM0CKEN_Msk        (0x1ul << CLK_BPWMCTL_BPWM0CKEN_Pos)              /*!< CLK_T::BPWMCTL: BPWM0CKEN Mask         */

#define CLK_BPWMCTL_BPWM1CKEN_Pos        (1)                                               /*!< CLK_T::BPWMCTL: BPWM1CKEN Position     */
#define CLK_BPWMCTL_BPWM1CKEN_Msk        (0x1ul << CLK_BPWMCTL_BPWM1CKEN_Pos)              /*!< CLK_T::BPWMCTL: BPWM1CKEN Mask         */

#define CLK_CRCCTL_CRC0CKEN_Pos          (0)                                               /*!< CLK_T::CRCCTL: CRC0CKEN Position       */
#define CLK_CRCCTL_CRC0CKEN_Msk          (0x1ul << CLK_CRCCTL_CRC0CKEN_Pos)                /*!< CLK_T::CRCCTL: CRC0CKEN Mask           */

#define CLK_FMCCTL_FMC0CKEN_Pos          (0)                                               /*!< CLK_T::FMCCTL: FMC0CKEN Position       */
#define CLK_FMCCTL_FMC0CKEN_Msk          (0x1ul << CLK_FMCCTL_FMC0CKEN_Pos)                /*!< CLK_T::FMCCTL: FMC0CKEN Mask           */

#define CLK_FMCCTL_DFMC0CKEN_Pos         (8)                                               /*!< CLK_T::FMCCTL: DFMC0CKEN Position      */
#define CLK_FMCCTL_DFMC0CKEN_Msk         (0x1ul << CLK_FMCCTL_DFMC0CKEN_Pos)               /*!< CLK_T::FMCCTL: DFMC0CKEN Mask          */

#define CLK_FMCCTL_ISP0CKEN_Pos          (16)                                              /*!< CLK_T::FMCCTL: ISP0CKEN Position       */
#define CLK_FMCCTL_ISP0CKEN_Msk          (0x1ul << CLK_FMCCTL_ISP0CKEN_Pos)                /*!< CLK_T::FMCCTL: ISP0CKEN Mask           */

#define CLK_GPIOCTL_GPIOACKEN_Pos        (0)                                               /*!< CLK_T::GPIOCTL: GPIOACKEN Position     */
#define CLK_GPIOCTL_GPIOACKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIOACKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIOACKEN Mask         */

#define CLK_GPIOCTL_GPIOBCKEN_Pos        (1)                                               /*!< CLK_T::GPIOCTL: GPIOBCKEN Position     */
#define CLK_GPIOCTL_GPIOBCKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIOBCKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIOBCKEN Mask         */

#define CLK_GPIOCTL_GPIOCCKEN_Pos        (2)                                               /*!< CLK_T::GPIOCTL: GPIOCCKEN Position     */
#define CLK_GPIOCTL_GPIOCCKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIOCCKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIOCCKEN Mask         */

#define CLK_GPIOCTL_GPIODCKEN_Pos        (3)                                               /*!< CLK_T::GPIOCTL: GPIODCKEN Position     */
#define CLK_GPIOCTL_GPIODCKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIODCKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIODCKEN Mask         */

#define CLK_GPIOCTL_GPIOECKEN_Pos        (4)                                               /*!< CLK_T::GPIOCTL: GPIOECKEN Position     */
#define CLK_GPIOCTL_GPIOECKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIOECKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIOECKEN Mask         */

