wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
#define CLK_GPIOCTL_GPIOFCKEN_Pos        (5)                                               /*!< CLK_T::GPIOCTL: GPIOFCKEN Position     */
#define CLK_GPIOCTL_GPIOFCKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIOFCKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIOFCKEN Mask         */

#define CLK_GPIOCTL_GPIOGCKEN_Pos        (6)                                               /*!< CLK_T::GPIOCTL: GPIOGCKEN Position     */
#define CLK_GPIOCTL_GPIOGCKEN_Msk        (0x1ul << CLK_GPIOCTL_GPIOGCKEN_Pos)              /*!< CLK_T::GPIOCTL: GPIOGCKEN Mask         */

#define CLK_I2CCTL_I2C0CKEN_Pos          (0)                                               /*!< CLK_T::I2CCTL: I2C0CKEN Position       */
#define CLK_I2CCTL_I2C0CKEN_Msk          (0x1ul << CLK_I2CCTL_I2C0CKEN_Pos)                /*!< CLK_T::I2CCTL: I2C0CKEN Mask           */

#define CLK_I2CCTL_I2C1CKEN_Pos          (1)                                               /*!< CLK_T::I2CCTL: I2C1CKEN Position       */
#define CLK_I2CCTL_I2C1CKEN_Msk          (0x1ul << CLK_I2CCTL_I2C1CKEN_Pos)                /*!< CLK_T::I2CCTL: I2C1CKEN Mask           */

#define CLK_I2CCTL_I2C2CKEN_Pos          (2)                                               /*!< CLK_T::I2CCTL: I2C2CKEN Position       */
#define CLK_I2CCTL_I2C2CKEN_Msk          (0x1ul << CLK_I2CCTL_I2C2CKEN_Pos)                /*!< CLK_T::I2CCTL: I2C2CKEN Mask           */

#define CLK_PDMACTL_PDMA0CKEN_Pos        (0)                                               /*!< CLK_T::PDMACTL: PDMA0CKEN Position     */
#define CLK_PDMACTL_PDMA0CKEN_Msk        (0x1ul << CLK_PDMACTL_PDMA0CKEN_Pos)              /*!< CLK_T::PDMACTL: PDMA0CKEN Mask         */

#define CLK_RTCCTL_RTC0CKEN_Pos          (0)                                               /*!< CLK_T::RTCCTL: RTC0CKEN Position       */
#define CLK_RTCCTL_RTC0CKEN_Msk          (0x1ul << CLK_RTCCTL_RTC0CKEN_Pos)                /*!< CLK_T::RTCCTL: RTC0CKEN Mask           */

#define CLK_SRAMCTL_SRAM0CKEN_Pos        (0)                                               /*!< CLK_T::SRAMCTL: SRAM0CKEN Position     */
#define CLK_SRAMCTL_SRAM0CKEN_Msk        (0x1ul << CLK_SRAMCTL_SRAM0CKEN_Pos)              /*!< CLK_T::SRAMCTL: SRAM0CKEN Mask         */

#define CLK_SRAMCTL_SRAM1CKEN_Pos        (1)                                               /*!< CLK_T::SRAMCTL: SRAM1CKEN Position     */
#define CLK_SRAMCTL_SRAM1CKEN_Msk        (0x1ul << CLK_SRAMCTL_SRAM1CKEN_Pos)              /*!< CLK_T::SRAMCTL: SRAM1CKEN Mask         */

#define CLK_STCTL_ST0CKEN_Pos            (0)                                               /*!< CLK_T::STCTL: ST0CKEN Position         */
#define CLK_STCTL_ST0CKEN_Msk            (0x1ul << CLK_STCTL_ST0CKEN_Pos)                  /*!< CLK_T::STCTL: ST0CKEN Mask             */

#define CLK_TMRCTL_TMR0CKEN_Pos          (0)                                               /*!< CLK_T::TMRCTL: TMR0CKEN Position       */
#define CLK_TMRCTL_TMR0CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR0CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR0CKEN Mask           */

#define CLK_TMRCTL_TMR1CKEN_Pos          (1)                                               /*!< CLK_T::TMRCTL: TMR1CKEN Position       */
#define CLK_TMRCTL_TMR1CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR1CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR1CKEN Mask           */

#define CLK_TMRCTL_TMR2CKEN_Pos          (2)                                               /*!< CLK_T::TMRCTL: TMR2CKEN Position       */
#define CLK_TMRCTL_TMR2CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR2CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR2CKEN Mask           */

#define CLK_TMRCTL_TMR3CKEN_Pos          (3)                                               /*!< CLK_T::TMRCTL: TMR3CKEN Position       */
#define CLK_TMRCTL_TMR3CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR3CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR3CKEN Mask           */

#define CLK_TMRCTL_TMR4CKEN_Pos          (4)                                               /*!< CLK_T::TMRCTL: TMR4CKEN Position       */
#define CLK_TMRCTL_TMR4CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR4CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR4CKEN Mask           */

#define CLK_TMRCTL_TMR5CKEN_Pos          (5)                                               /*!< CLK_T::TMRCTL: TMR5CKEN Position       */
#define CLK_TMRCTL_TMR5CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR5CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR5CKEN Mask           */

#define CLK_TMRCTL_TMR6CKEN_Pos          (6)                                               /*!< CLK_T::TMRCTL: TMR6CKEN Position       */
#define CLK_TMRCTL_TMR6CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR6CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR6CKEN Mask           */

#define CLK_TMRCTL_TMR7CKEN_Pos          (7)                                               /*!< CLK_T::TMRCTL: TMR7CKEN Position       */
#define CLK_TMRCTL_TMR7CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR7CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR7CKEN Mask           */

#define CLK_TMRCTL_TMR8CKEN_Pos          (8)                                               /*!< CLK_T::TMRCTL: TMR8CKEN Position       */
#define CLK_TMRCTL_TMR8CKEN_Msk          (0x1ul << CLK_TMRCTL_TMR8CKEN_Pos)                /*!< CLK_T::TMRCTL: TMR8CKEN Mask           */

#define CLK_UARTCTL_UART0CKEN_Pos        (0)                                               /*!< CLK_T::UARTCTL: UART0CKEN Position     */
#define CLK_UARTCTL_UART0CKEN_Msk        (0x1ul << CLK_UARTCTL_UART0CKEN_Pos)              /*!< CLK_T::UARTCTL: UART0CKEN Mask         */

#define CLK_UARTCTL_UART1CKEN_Pos        (1)                                               /*!< CLK_T::UARTCTL: UART1CKEN Position     */
#define CLK_UARTCTL_UART1CKEN_Msk        (0x1ul << CLK_UARTCTL_UART1CKEN_Pos)              /*!< CLK_T::UARTCTL: UART1CKEN Mask         */

#define CLK_UARTCTL_UART2CKEN_Pos        (2)                                               /*!< CLK_T::UARTCTL: UART2CKEN Position     */
#define CLK_UARTCTL_UART2CKEN_Msk        (0x1ul << CLK_UARTCTL_UART2CKEN_Pos)              /*!< CLK_T::UARTCTL: UART2CKEN Mask         */

#define CLK_UARTCTL_UART3CKEN_Pos        (3)                                               /*!< CLK_T::UARTCTL: UART3CKEN Position     */
#define CLK_UARTCTL_UART3CKEN_Msk        (0x1ul << CLK_UARTCTL_UART3CKEN_Pos)              /*!< CLK_T::UARTCTL: UART3CKEN Mask         */

#define CLK_UARTCTL_UART4CKEN_Pos        (4)                                               /*!< CLK_T::UARTCTL: UART4CKEN Position     */
#define CLK_UARTCTL_UART4CKEN_Msk        (0x1ul << CLK_UARTCTL_UART4CKEN_Pos)              /*!< CLK_T::UARTCTL: UART4CKEN Mask         */

