wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
#define CLK_USCICTL_USCI0CKEN_Pos        (0)                                               /*!< CLK_T::USCICTL: USCI0CKEN Position     */
#define CLK_USCICTL_USCI0CKEN_Msk        (0x1ul << CLK_USCICTL_USCI0CKEN_Pos)              /*!< CLK_T::USCICTL: USCI0CKEN Mask         */

#define CLK_USCICTL_USCI1CKEN_Pos        (1)                                               /*!< CLK_T::USCICTL: USCI1CKEN Position     */
#define CLK_USCICTL_USCI1CKEN_Msk        (0x1ul << CLK_USCICTL_USCI1CKEN_Pos)              /*!< CLK_T::USCICTL: USCI1CKEN Mask         */

#define CLK_USCICTL_USCI2CKEN_Pos        (2)                                               /*!< CLK_T::USCICTL: USCI2CKEN Position     */
#define CLK_USCICTL_USCI2CKEN_Msk        (0x1ul << CLK_USCICTL_USCI2CKEN_Pos)              /*!< CLK_T::USCICTL: USCI2CKEN Mask         */

#define CLK_USCICTL_USCI3CKEN_Pos        (3)                                               /*!< CLK_T::USCICTL: USCI3CKEN Position     */
#define CLK_USCICTL_USCI3CKEN_Msk        (0x1ul << CLK_USCICTL_USCI3CKEN_Pos)              /*!< CLK_T::USCICTL: USCI3CKEN Mask         */

#define CLK_USCICTL_USCI4CKEN_Pos        (4)                                               /*!< CLK_T::USCICTL: USCI4CKEN Position     */
#define CLK_USCICTL_USCI4CKEN_Msk        (0x1ul << CLK_USCICTL_USCI4CKEN_Pos)              /*!< CLK_T::USCICTL: USCI4CKEN Mask         */

#define CLK_WDTCTL_WDT0CKEN_Pos          (0)                                               /*!< CLK_T::WDTCTL: WDT0CKEN Position       */
#define CLK_WDTCTL_WDT0CKEN_Msk          (0x1ul << CLK_WDTCTL_WDT0CKEN_Pos)                /*!< CLK_T::WDTCTL: WDT0CKEN Mask           */

#define CLK_WWDTCTL_WWDT0CKEN_Pos        (0)                                               /*!< CLK_T::WWDTCTL: WWDT0CKEN Position     */
#define CLK_WWDTCTL_WWDT0CKEN_Msk        (0x1ul << CLK_WWDTCTL_WWDT0CKEN_Pos)              /*!< CLK_T::WWDTCTL: WWDT0CKEN Mask         */

#define CLK_HCLKSEL_HCLKSEL_Pos          (0)                                               /*!< CLK_T::HCLKSEL: HCLKSEL Position       */
#define CLK_HCLKSEL_HCLKSEL_Msk          (0x7ul << CLK_HCLKSEL_HCLKSEL_Pos)                /*!< CLK_T::HCLKSEL: HCLKSEL Mask           */

#define CLK_BPWMSEL_BPWM0SEL_Pos         (0)                                               /*!< CLK_T::BPWMSEL: BPWM0SEL Position      */
#define CLK_BPWMSEL_BPWM0SEL_Msk         (0x1ul << CLK_BPWMSEL_BPWM0SEL_Pos)               /*!< CLK_T::BPWMSEL: BPWM0SEL Mask          */

#define CLK_BPWMSEL_BPWM1SEL_Pos         (4)                                               /*!< CLK_T::BPWMSEL: BPWM1SEL Position      */
#define CLK_BPWMSEL_BPWM1SEL_Msk         (0x1ul << CLK_BPWMSEL_BPWM1SEL_Pos)               /*!< CLK_T::BPWMSEL: BPWM1SEL Mask          */

#define CLK_CLKOSEL_CLKOSEL_Pos          (0)                                               /*!< CLK_T::CLKOSEL: CLKOSEL Position       */
#define CLK_CLKOSEL_CLKOSEL_Msk          (0x7ul << CLK_CLKOSEL_CLKOSEL_Pos)                /*!< CLK_T::CLKOSEL: CLKOSEL Mask           */

#define CLK_TMRSEL0_TMR0SEL_Pos          (0)                                               /*!< CLK_T::TMRSEL0: TMR0SEL Position       */
#define CLK_TMRSEL0_TMR0SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR0SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR0SEL Mask           */

#define CLK_TMRSEL0_TMR1SEL_Pos          (4)                                               /*!< CLK_T::TMRSEL0: TMR1SEL Position       */
#define CLK_TMRSEL0_TMR1SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR1SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR1SEL Mask           */

#define CLK_TMRSEL0_TMR2SEL_Pos          (8)                                               /*!< CLK_T::TMRSEL0: TMR2SEL Position       */
#define CLK_TMRSEL0_TMR2SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR2SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR2SEL Mask           */

#define CLK_TMRSEL0_TMR3SEL_Pos          (12)                                              /*!< CLK_T::TMRSEL0: TMR3SEL Position       */
#define CLK_TMRSEL0_TMR3SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR3SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR3SEL Mask           */

#define CLK_TMRSEL0_TMR4SEL_Pos          (16)                                              /*!< CLK_T::TMRSEL0: TMR4SEL Position       */
#define CLK_TMRSEL0_TMR4SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR4SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR4SEL Mask           */

#define CLK_TMRSEL0_TMR5SEL_Pos          (20)                                              /*!< CLK_T::TMRSEL0: TMR5SEL Position       */
#define CLK_TMRSEL0_TMR5SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR5SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR5SEL Mask           */

#define CLK_TMRSEL0_TMR6SEL_Pos          (24)                                              /*!< CLK_T::TMRSEL0: TMR6SEL Position       */
#define CLK_TMRSEL0_TMR6SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR6SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR6SEL Mask           */

#define CLK_TMRSEL0_TMR7SEL_Pos          (28)                                              /*!< CLK_T::TMRSEL0: TMR7SEL Position       */
#define CLK_TMRSEL0_TMR7SEL_Msk          (0x7ul << CLK_TMRSEL0_TMR7SEL_Pos)                /*!< CLK_T::TMRSEL0: TMR7SEL Mask           */

#define CLK_TMRSEL1_TMR8SEL_Pos          (0)                                               /*!< CLK_T::TMRSEL1: TMR8SEL Position       */
#define CLK_TMRSEL1_TMR8SEL_Msk          (0x7ul << CLK_TMRSEL1_TMR8SEL_Pos)                /*!< CLK_T::TMRSEL1: TMR8SEL Mask           */

#define CLK_UARTSEL_UART0SEL_Pos         (0)                                               /*!< CLK_T::UARTSEL: UART0SEL Position      */
#define CLK_UARTSEL_UART0SEL_Msk         (0x7ul << CLK_UARTSEL_UART0SEL_Pos)               /*!< CLK_T::UARTSEL: UART0SEL Mask          */

#define CLK_UARTSEL_UART1SEL_Pos         (4)                                               /*!< CLK_T::UARTSEL: UART1SEL Position      */
#define CLK_UARTSEL_UART1SEL_Msk         (0x7ul << CLK_UARTSEL_UART1SEL_Pos)               /*!< CLK_T::UARTSEL: UART1SEL Mask          */

#define CLK_UARTSEL_UART2SEL_Pos         (8)                                               /*!< CLK_T::UARTSEL: UART2SEL Position      */
#define CLK_UARTSEL_UART2SEL_Msk         (0x7ul << CLK_UARTSEL_UART2SEL_Pos)               /*!< CLK_T::UARTSEL: UART2SEL Mask          */

