wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/clk_reg.h
#define CLK_UARTSEL_UART3SEL_Pos         (12)                                              /*!< CLK_T::UARTSEL: UART3SEL Position      */
#define CLK_UARTSEL_UART3SEL_Msk         (0x7ul << CLK_UARTSEL_UART3SEL_Pos)               /*!< CLK_T::UARTSEL: UART3SEL Mask          */

#define CLK_UARTSEL_UART4SEL_Pos         (16)                                              /*!< CLK_T::UARTSEL: UART4SEL Position      */
#define CLK_UARTSEL_UART4SEL_Msk         (0x7ul << CLK_UARTSEL_UART4SEL_Pos)               /*!< CLK_T::UARTSEL: UART4SEL Mask          */

#define CLK_WDTSEL_WDT0SEL_Pos           (0)                                               /*!< CLK_T::WDTSEL: WDT0SEL Position        */
#define CLK_WDTSEL_WDT0SEL_Msk           (0x3ul << CLK_WDTSEL_WDT0SEL_Pos)                 /*!< CLK_T::WDTSEL: WDT0SEL Mask            */

#define CLK_WWDTSEL_WWDT0SEL_Pos         (0)                                               /*!< CLK_T::WWDTSEL: WWDT0SEL Position      */
#define CLK_WWDTSEL_WWDT0SEL_Msk         (0x1ul << CLK_WWDTSEL_WWDT0SEL_Pos)               /*!< CLK_T::WWDTSEL: WWDT0SEL Mask          */

#define CLK_HCLKDIV_HCLKDIV_Pos          (0)                                               /*!< CLK_T::HCLKDIV: HCLKDIV Position       */
#define CLK_HCLKDIV_HCLKDIV_Msk          (0xful << CLK_HCLKDIV_HCLKDIV_Pos)                /*!< CLK_T::HCLKDIV: HCLKDIV Mask           */

#define CLK_PCLKDIV_PCLK0DIV_Pos         (0)                                               /*!< CLK_T::PCLKDIV: PCLK0DIV Position      */
#define CLK_PCLKDIV_PCLK0DIV_Msk         (0x7ul << CLK_PCLKDIV_PCLK0DIV_Pos)               /*!< CLK_T::PCLKDIV: PCLK0DIV Mask          */

#define CLK_PCLKDIV_PCLK1DIV_Pos         (4)                                               /*!< CLK_T::PCLKDIV: PCLK1DIV Position      */
#define CLK_PCLKDIV_PCLK1DIV_Msk         (0x7ul << CLK_PCLKDIV_PCLK1DIV_Pos)               /*!< CLK_T::PCLKDIV: PCLK1DIV Mask          */

#define CLK_ADCDIV_ADC0DIV_Pos           (0)                                               /*!< CLK_T::ADCDIV: ADC0DIV Position        */
#define CLK_ADCDIV_ADC0DIV_Msk           (0xfful << CLK_ADCDIV_ADC0DIV_Pos)                /*!< CLK_T::ADCDIV: ADC0DIV Mask            */

#define CLK_UARTDIV_UART0DIV_Pos         (0)                                               /*!< CLK_T::UARTDIV: UART0DIV Position      */
#define CLK_UARTDIV_UART0DIV_Msk         (0xful << CLK_UARTDIV_UART0DIV_Pos)               /*!< CLK_T::UARTDIV: UART0DIV Mask          */

#define CLK_UARTDIV_UART1DIV_Pos         (4)                                               /*!< CLK_T::UARTDIV: UART1DIV Position      */
#define CLK_UARTDIV_UART1DIV_Msk         (0xful << CLK_UARTDIV_UART1DIV_Pos)               /*!< CLK_T::UARTDIV: UART1DIV Mask          */

#define CLK_UARTDIV_UART2DIV_Pos         (8)                                               /*!< CLK_T::UARTDIV: UART2DIV Position      */
#define CLK_UARTDIV_UART2DIV_Msk         (0xful << CLK_UARTDIV_UART2DIV_Pos)               /*!< CLK_T::UARTDIV: UART2DIV Mask          */

#define CLK_UARTDIV_UART3DIV_Pos         (12)                                              /*!< CLK_T::UARTDIV: UART3DIV Position      */
#define CLK_UARTDIV_UART3DIV_Msk         (0xful << CLK_UARTDIV_UART3DIV_Pos)               /*!< CLK_T::UARTDIV: UART3DIV Mask          */

#define CLK_UARTDIV_UART4DIV_Pos         (16)                                              /*!< CLK_T::UARTDIV: UART4DIV Position      */
#define CLK_UARTDIV_UART4DIV_Msk         (0xful << CLK_UARTDIV_UART4DIV_Pos)               /*!< CLK_T::UARTDIV: UART4DIV Mask          */

/**@}*/ /* CLK_CONST */
/**@}*/ /* end of CLK register group */
/**@}*/ /* end of REGISTER group */

#endif /* __CLK_REG_H__ */
